Repository: Sambrano223/documentation
Catalog: user_manual/locale/*/LC_MESSAGES/session_management.po
Languages: ru

source: Manage connected browsers and devices
ru: Управление подключенными браузерами и устройствами

source: The personal settings page allows you to have an overview on the connected browsers and devices.
ru: Страница личных настроек позволяет вам увидеть подключенные браузеры и устройства.

source: Managing connected browsers
ru: Управление подключенными браузерами

source: In the list of connected browsers you see which browsers connected to your account recently:
ru: В списке подключенных браузеров вы видите, какие браузеры недавно подключались к вашей учетной записи:

source: You can use the trash icon to disconnect any of the browsers in the list.
ru: Вы можете использовать значок корзины, чтобы отключить любой из браузеров в списке.

source: Managing devices
ru: Управление устройствами

source: In the list of connected devices you see all the devices and clients you generated a device password for and their last activity:
ru: В списке подключенных устройств вы видите все устройства и клиенты, для которых вы сгенерировали пароль устройства, и их последние действия:

source: You can use the trash icon to disconnect any of the devices in the list.
ru: Вы можете использовать значок корзины, чтобы отключить любое из устройств в списке.

source: At the bottom of the list you find a button to create a new device-specific password. You can choose a name to identify the token later. The generated password is used for configuring the new client. Ideally, generate individual tokens for every device you connect to your account, so you can disconnect those individually if necessary.
ru: Внизу списка вы найдете кнопку для создания нового пароля для конкретного устройства. Вы можете выбрать имя для идентификации токена позже. Сгенерированный пароль используется для настройки нового клиента. В идеале генерируйте индивидуальные токены для каждого устройства, которое вы подключаете к своей учетной записи, чтобы при необходимости вы могли отключить их по отдельности.

source: You have only access to the device password when creating it, Nextcloud will not save the plain password, hence it's recommended to enter the password on the new client immediately.
ru: У вас есть доступ только к паролю устройства при его создании, Nextcloud не будет сохранять простой пароль, поэтому рекомендуется немедленно ввести пароль на новом клиенте.

source: If you are :doc:`user_2fa` for your account, device-specific passwords are the only way to configure clients. The client will deny connections of clients using your login password then.
ru: Если вы используете :doc:`user_2fa` для своей учетной записи, то пароли для конкретного устройства являются единственным способом настройки клиентов. Тогда клиент будет запрещать подключения клиентов, используя ваш пароль для входа.

source: Device-specific passwords and password changes
ru: Пароли для конкретного устройства и изменения пароля

source: For password changes in external user backends the device-specific passwords are marked as invalid and once a login of the user account with the main password happens all device-specific passwords are updated and work again.
ru: При смене пароля во внешних пользовательских бэкэндах пароли, специфичные для устройства, помечаются как недействительные, и после входа в учетную запись пользователя с основным паролем все пароли для конкретного устройства обновляются и снова работают.
