Repository: Sambrano223/documentation
Catalog: user_manual/locale/*/LC_MESSAGES/webinterface.po
Languages: ca

source: The Nextcloud Web interface
ca: La interfície web de Nextcloud

source: You can connect to your Nextcloud server using any Web browser. Just point it to your Nextcloud server URL (e.g. cloud.example.com) and enter your username and password.
ca: Us podeu connectar al vostre servidor de Nextcloud fent servir qualsevol navegador web. Només cal apuntar a la URL del vostre servidor Nextcloud (e.g. cloud.example.com) i introduir el vostre usuari i contrasenya.

source: Web browser requirements
ca: Requeriments del navegador web

source: For the best experience with the Nextcloud web interface, we recommend that you use the latest and supported version of a browser from this list:
ca: Per tindre la millor experiència possible amb la interfície web de Nextcloud, recomanem que feu servir la versió més recent suportada d'un dels navegadors d'aquesta llista:

source: If you want to use Nextcloud Talk you need to run Mozilla **Firefox** 52+ or Google **Chrome**/Chromium 49+ to have the full experience with video calls and screensharing. Google **Chrome**/Chromium requires a additional plugin for screensharing.
ca: Si voleu fer servir Nextcloud Talk heu de fer servir Mozilla **Firefox** 52+ o Google **Chrome**/Chromium 49+ per gaudir de l'experiència completa amb trucades de vídeo i pantalla compartida. Google **Chrome**/Chromium requereix una extensió addicional per compartir pantalla.

source: Navigating the main user interface
ca: Explorant la interfície principal d'usuari

source: By default, the Nextcloud Web interface opens to your Files page. You can add, remove, and share files, and make changes based on the access privileges set by you (if you are administering the server) or by your server administrator.
ca: Per defecte, l'Interfície Web de Nextcloud s'obre a la pàgina de Fitxers. Podeu afegir, esborrar i compartir fitxers, i fer canvis basats en els privilegis d'accés configurats per vosaltres (si administreu el servidor) o pel vostre administrador de sistema.

source: The Nextcloud user interface contains the following fields and functions:
ca: La interfície d'usuari de Nextcloud conté els següents camps i funcions:

source: **Apps Selection Menu** (1): Located in the upper left corner, you'll find all your apps which are available on your instance of Nextcloud. Clicking on an apps icon will redirect you to the app.
ca: **Menú de Selecció d'Aplicacions** (1): Situat a la cantonada superior esquerra, hi trobareu totes les aplicacions disponibles a la vostra instància de Nextcloud. Si feu clic sobre l'icona d'una app hi sereu redirigits.

source: **Apps Information** field (2): Located in the left sidebar, this provides filters and tasks associated with your selected app. For example, when you are using the Files apps you have a special set of filters for quickly finding your files, such as files that have been shared with you, and files that you have shared with others. You'll see different items for other apps.
ca: Camp d'**Informació d'Aplicacions** (2): Situat a la barra lateral esquerra, proporciona filtres i tasques associades amb l'aplicació seleccionada. Per exemple, quan esteu fent servir l'aplicació Fitxers hi trobareu un conjunt de filtres per trobar ràpidament els vostres fitxers, com ara fitxers que han estat compartits amb vosaltres i fitxers que vosaltres heu compartit amb altres. Veureu elements diferents per a altres aplicacions.

source: **Application View** (3): The main central field in the Nextcloud user interface. This field displays the contents or user features of your selected app.
ca: ** Vista d'Aplicació** (3): El camp principal al centre de la interfície d'usuari de Nextcloud. Aquest camp mostra els continguts o funcionalitats de l'aplicació seleccionada.

source: **Navigation Bar** (4): Located over the main viewing window (the Application View), this bar provides a type of breadcrumbs navigation that enables you to migrate to higher levels of the folder hierarchy up to the root level (home).
ca: **Barra de Navegació** (4): Situada sobre la vista principal (la Vista d'Aplicació), aquesta barra proporciona una mena de navegació per fil d'Ariadna que us permet ascendir a nivells superiors de la jerarquia de carpetes fins arribar al nivell arrel (carpeta de l'usuari)

source: **New** button (5): Located in the Navigation Bar, the ``New`` button enables you to create new files, new folders, or upload files.
ca: Botó **Nou** (5): Situat a la Barra de Navegació, el botó ``Nou`` us permet crear nous arxius, noves carpetes, o pujar arxius.

source: You can also drag and drop files from your file manager into the Files Application View to upload them to your instance. Currently, the only Web browsers that support drag-and-drop folders are Chrome and Chromium.
ca: També podeu arrossegar i deixar anar fitxers des del vostre gestor de fitxers a la Vista d'Aplicació de Fitxers per pujar-los a la vostra instància. En aquests moments els únics navegadors Web que suporten arrossegar i deixar anar carpetes són Chrome i Chromium.

source: **Search** field (6): Click on the magnifier in the upper right hand corner of to search for files.
ca: Camp de **Cerca** (6): Feu clic a la lupa a la cantonada superior dreta per cercar fitxers.

source: **Contacts Menu** (7): Gives you an overview about your contacts and users on your server. Dependent on the given details and available apps, you can directly start a video call with them or send emails.
ca: **Menú de Contactes** (7): Us ofereix una vista general dels vostres contactes i d'altres usuaris del vostre servidor. Depenent dels detalls proporcionats i de les aplicacions disponibles, podeu començar directament una trucada de vídeo amb ells o enviar-los emails.

source: **Gallery** button (8). This looks like four little squares, and takes you directly to your image gallery.
ca: Botó **Galeria** (8): La icona mostra quatre petits quadrats, i us portarà directament a la vostra galeria d'imatges.

source: **Settings** menu (9): Click on your profile picture, located to the right of the Search field, to open your Settings dropdown menu. Your Settings page provides the following settings and features:
ca: Menú de **Configuració** (9): Feu clic a la vostra imatge de perfil, situada a la dreta del camp de Cerca, per obrir el menú desplegable de Configuració. La vostra pàgina de Configuració proporciona les següents opcions i funcionalitats:

source: Links to download desktop and mobile apps
ca: Enllaços a descàrregues d'aplicacions per escriptori i dispositius mòbils

source: Server usage and space availability
ca: Ús del servidor i disponibilitat d'espai

source: Password management
ca: Gestió de contrasenyes

source: Name, email, and profile picture settings
ca: Configuració de nom, correu electrònic, i imatge de perfil

source: Manage connected browsers and devices
ca: Gestioneu navegadors i dispositius connectats

source: Group memberships
ca: Pertinença a grups

source: Interface language settings
ca: Configuració d'idiomes de la interfície

source: Manage notifications
ca: Gestioneu les notificacions

source: Federated Cloud ID and social media-sharing buttons
ca: Botons de Federated Cloud ID i compartició a xarxes socials

source: SSL/TLS certificate manager for external storages
ca: Gestor de certificats SSL/TLS per a emmagatzematges externs

source: Your Two-factor Settings
ca: La vostra configuració d'autenticació de dos factors

source: Nextcloud Version information
ca: Informació de la Versió de Nextcloud

source: See :doc:`userpreferences` section to learn more about these settings.
ca: Veieu :doc:`userpreferences` per aprendre més sobre aquestes opcions
