Repository: Sambrano223/documentation
Catalog: user_manual/locale/*/LC_MESSAGES/pim/sync_ios.po
Languages: cs

source: Synchronizing with iOS
cs: Synchronizace se systémem iOS

source: Calendar
cs: Kalendář

source: Open the settings application.
cs: Otevřete aplikaci nastavení.

source: Select Passwords and Accounts.
cs: Vyberte hesla a účty.

source: Select Add Account.
cs: Vyberte přidat účet.

source: Select Other as account type.
cs: Jako typ účtu vyberte Ostatní.

source: Select Add CalDAV account.
cs: Vyberte Přidat CalDAV účet.

source: For server, type the domain name of your server i.e. ``example.com``.
cs: Pro server, zadejte název domény svého serveru např. ``example.com``.

source: Enter your user name and password.
cs: Zadejte své uživatelské jméno a heslo.

source: Select Next.
cs: Vyberte Další.

source: Your calendar will now be visible in the Calendar application.
cs: Váš kalendář nyní bude viditelný v aplikaci Kalendář.

source: Beginning with iOS 12 an SSL encryption is necessary. Therefore do **not** disable **SSL** (For this reason a certificate is required at your domain, https://letsencrypt.org/ will do).
cs: Od verze iOS 12 je SSL šifrování nezbytné. Proto **nevypínejte** **SSL** (Z tohoto důvodu je pro vaši doménu zapotřebí certifikát, postačí i ten ze služby https://letsencrypt.org/ ).

source: Contacts
cs: Kontakty

source: Select Add CardDAV account.
cs: Vyberte Přidat CardDAV účet.

source: You should now find your contacts in the address book of your iPhone.
cs: Nyní byste své kontakty měli nalézt v adresáři svého iPhone.

source: If it's still not working, have a look at the `Troubleshooting Contacts & Calendar`_ guide.
cs: Pokud to ani tak nefunguje, podívejte se do příručky `Řešení problémů s kontakty a kalendářem`_ .
