Repository: Sambrano223/documentation
Catalog: user_manual/locale/*/LC_MESSAGES/files/sharing.po
Languages: ru

source: File Sharing
ru: Обмен файлами

source: Nextcloud users can share files and folders. Possible targets are
ru: Пользователи Nextcloud могут обмениваться файлами и папками. Возможные цели

source: public links
ru: публичные ссылки

source: users
ru: пользователи

source: groups
ru: группы

source: circles
ru: круги

source: talk conversations
ru: конференции

source: users or groups on federated Nextcloud servers
ru: пользователи или группы на федеративных серверах Nextcloud

source: Some options may note be available due to administrative configuration. See :doc:`admin documentation <file_sharing_configuration>` for details.
ru: Некоторые параметры могут быть доступны из-за административной конфигурации. Подробности смотрите в :doc:`документации администратора <file_sharing_configuration>`.

source: Public link shares
ru: Публичная ссылка делится

source: You can share files and folders via public links.
ru: Вы можете делиться файлами и папками через публичные ссылки.

source: A random 15-digit token will be created. The link will look like ``https://cloud.example.com/s/yxcFKRWBJqYYzp4``.
ru: Будет создан случайный 15-значный токен. Ссылка будет выглядеть как ``https://cloud.example.com/s/yxcFKRWBJqYYzp4``.

source: A number of options are available for public *folder* shares:
ru: Для общих папок *каталог* доступны несколько параметров:

source: **Read only** to allow viewing and downloading
ru: **Только для чтения**, чтобы разрешить просмотр и скачивание

source: ** Allow upload and editing**
ru: **Разрешить загрузку и редактирование**

source: With ** File drop**, the sharee can only upload files to a folder without seeing the files that are already in that folder.
ru: С помощью **Загрузка файла**, можно загружать файлы только в папку, не видя файлы, которые уже находятся в этой папке.

source: **Hide download** prevents the sharee from downloading
ru: **Скрыть загрузку** запрещает загрузку общего ресурса

source: **Password protect**
ru: **Защита паролем**

source: **Set expiration date** will automatically disable the share
ru: **Установить срок действия** автоматически отключит общий доступ

source: **Note to recipient**
ru: **Примечание для получателя**

source: **Unshare** to revert the share
ru: **Отменить общий доступ**

source: **Add another link** to create multiple public links with different rights
ru: **Добавить еще одну ссылку**, чтобы создать несколько общедоступных ссылок с разными правами

source: For public *file* shares, you may allow editing the file with one of Nextcloud's collaborative editing solutions.
ru: Для общедоступных *файлов* общих ресурсов вы можете разрешить редактирование файла с помощью одного из решений для совместного редактирования Nextcloud.

source: Internal shares with users and groups
ru: Внутренние общие ресурсы для пользователей и групп

source: When sharing with users, groups, circles or members of a Talk conversation, rights for the files or folder contents are adjustable:
ru: При совместном использовании с пользователями, группами, кругами или участниками Конференции права на файлы и содержимое папок регулируются:

source: As a sharee, you can configure if you automatically want to accept all incoming shares and have them added to your root folder, or if you want to be asked each time if you want to accept or decline the share.
ru: В качестве общего ресурса вы можете настроить, хотите ли вы автоматически принимать все входящие общие ресурсы и добавлять их в корневую папку, или если вы хотите, чтобы каждый раз вас спрашивали, хотите ли вы принять или отклонить общий ресурс.

source: For adjusting the acceptance setting, go to **Settings** > **Personal** > **Sharing**
ru: Для настройки параметров приема перейдите к **Настройки** > **Личные** > **Обмен**

source: Others with access
ru: Другие с доступом

source: In order to find out if a file or folder is accessible to others through sharing of a superior folder hierarchy level, click on **Others with access** in the sharing tab.
ru: Чтобы узнать, доступен ли файл или папка другим пользователям через общий уровень иерархии папок высшего уровня, нажмите **Другие с доступом** на вкладке общего доступа.

source: The list shows all users, groups, chats etc. that the current object has been given access to through sharing of a superior folder in the hierarchy.
ru: В списке отображаются все пользователи, группы, чаты и т. д., к которым текущему объекту был предоставлен доступ через общий доступ к вышестоящей папке в иерархии.

source: Click on the three dots to
ru: Нажмите на три точки, чтобы

source: see who initiated the share
ru: посмотреть, кто инициировал общий доступ

source: see where the share was initiated (click to navigate to the folder, as far as you have access there)
ru: увидеть, где был инициирован общий ресурс (нажмите, чтобы перейти к каталогу, если у вас есть доступ к нему)

source: unshare the initial share (only accessible for the share owner)
ru: отменить первоначальный доступ (возможно только владельцу общего ресурса)

source: This information is only visible to the owner of a file/folder or sharees with resharing rights.
ru: Эта информация видна только владельцу файла/папки, или публикуется с правами совместного доступа.

source: Federated Shares
ru: Федеративный общий ресурс

source: Federation Sharing allows you to mount file shares from remote Nextcloud servers, in effect creating your own cloud of Nextclouds. You can create direct share links with users on other Nextcloud servers.
ru: Федерация общего доступа позволяет вам монтировать общие папки с удаленных серверов Nextcloud, создавая собственное облако Nextcloud. Вы можете создавать прямые ссылки для пользователей на других серверах Nextcloud.

source: Creating a new Federation Share
ru: Создание новой федерации

source: Federation sharing is enabled by default. Follow these steps to create a new share with other Nextcloud or ownCloud servers:
ru: Общий доступ к федерации включен по умолчанию. Выполните следующие действия, чтобы создать новый общий ресурс с другими серверами Nextcloud или ownCloud:

source: Go to your ``Files`` page and click the Share icon on the file or directory you want to share. In the sidebar enter the username and URL of the remote user in this form: ``<username>@<nc-server-url>``. In this example, that is ``bob@cloud.example.com``.
ru: Перейдите на страницу ``Файлы`` и щелкните значок «Поделиться» в файле или каталоге, которым вы хотите поделиться. На боковой панели введите имя пользователя и URL-адрес удаленного пользователя в этой форме: ``<username>@<nc-server-url>``. В этом примере это ``bob@cloud.example.com``.

source: The sharee is receiving a notification in their Nextcloud, allowing them to either accept or decline the incoming share.
ru: Получатель общего доступа увидит уведомление в своем Nextcloud, что позволит ему принять или отклонить входящий общий ресурс.

source: Adding a public share to your Nextcloud
ru: Добавление публичного общего ресурса в ваш Nextcloud

source: Nextcloud public link share pages offer an option to add that file or folder as a federated share into your own Nextcloud instance. Just enter your ``<username>@<nc-server-url>`` just like shown for outbound shares above:
ru: Страницы общего доступа Nextcloud предлагают возможность добавить этот файл или папку в качестве федеративного общего ресурса в свой собственный экземпляр Nextcloud. Просто введите ваш ``<username>@<nc-server-url>``, как показано выше для исходящих акций:
